MikroElektronika/core_packages/PIC/XC8/def/PIC18F6390/mcu.h
extern volatile LCDDATA14bits_t LCDDATA14bits __at(0xF73);
// bitfield macros
#define _LCDDATA14_LCDDATA14_POSN                           0x0
#define _LCDDATA14_LCDDATA14_POSITION                       0x0
#define _LCDDATA14_LCDDATA14_SIZE                           0x8
#define _LCDDATA14_LCDDATA14_LENGTH                         0x8
#define _LCDDATA14_LCDDATA14_MASK                           0xFF
#define _LCDDATA14_S16C2_POSN                               0x0
#define _LCDDATA14_S16C2_POSITION                           0x0
#define _LCDDATA14_S16C2_SIZE                               0x1
#define _LCDDATA14_S16C2_LENGTH                             0x1
#define _LCDDATA14_S16C2_MASK                               0x1
#define _LCDDATA14_S17C2_POSN                               0x1
#define _LCDDATA14_S17C2_POSITION                           0x1
#define _LCDDATA14_S17C2_SIZE                               0x1
#define _LCDDATA14_S17C2_LENGTH                             0x1
#define _LCDDATA14_S17C2_MASK                               0x2
#define _LCDDATA14_S18C2_POSN                               0x2
#define _LCDDATA14_S18C2_POSITION                           0x2
#define _LCDDATA14_S18C2_SIZE                               0x1
#define _LCDDATA14_S18C2_LENGTH                             0x1
#define _LCDDATA14_S18C2_MASK                               0x4
#define _LCDDATA14_S19C2_POSN                               0x3
#define _LCDDATA14_S19C2_POSITION                           0x3
#define _LCDDATA14_S19C2_SIZE                               0x1
#define _LCDDATA14_S19C2_LENGTH                             0x1
#define _LCDDATA14_S19C2_MASK                               0x8
#define _LCDDATA14_S20C2_POSN                               0x4
#define _LCDDATA14_S20C2_POSITION                           0x4
#define _LCDDATA14_S20C2_SIZE                               0x1
#define _LCDDATA14_S20C2_LENGTH                             0x1
#define _LCDDATA14_S20C2_MASK                               0x10
#define _LCDDATA14_S21C2_POSN                               0x5
#define _LCDDATA14_S21C2_POSITION                           0x5
#define _LCDDATA14_S21C2_SIZE                               0x1
#define _LCDDATA14_S21C2_LENGTH                             0x1
#define _LCDDATA14_S21C2_MASK                               0x20
#define _LCDDATA14_S22C2_POSN                               0x6
#define _LCDDATA14_S22C2_POSITION                           0x6
#define _LCDDATA14_S22C2_SIZE                               0x1
#define _LCDDATA14_S22C2_LENGTH                             0x1
#define _LCDDATA14_S22C2_MASK                               0x40
#define _LCDDATA14_S23C2_POSN                               0x7
#define _LCDDATA14_S23C2_POSITION                           0x7
#define _LCDDATA14_S23C2_SIZE                               0x1
#define _LCDDATA14_S23C2_LENGTH                             0x1
#define _LCDDATA14_S23C2_MASK                               0x80
#define _LCDDATA14_SEG16COM2_POSN                           0x0
#define _LCDDATA14_SEG16COM2_POSITION                       0x0
#define _LCDDATA14_SEG16COM2_SIZE                           0x1
#define _LCDDATA14_SEG16COM2_LENGTH                         0x1
#define _LCDDATA14_SEG16COM2_MASK                           0x1
#define _LCDDATA14_SEG17COM2_POSN                           0x1
#define _LCDDATA14_SEG17COM2_POSITION                       0x1
#define _LCDDATA14_SEG17COM2_SIZE                           0x1
#define _LCDDATA14_SEG17COM2_LENGTH                         0x1
#define _LCDDATA14_SEG17COM2_MASK                           0x2
#define _LCDDATA14_SEG18COM2_POSN                           0x2
#define _LCDDATA14_SEG18COM2_POSITION                       0x2
#define _LCDDATA14_SEG18COM2_SIZE                           0x1
#define _LCDDATA14_SEG18COM2_LENGTH                         0x1
#define _LCDDATA14_SEG18COM2_MASK                           0x4
#define _LCDDATA14_SEG19COM2_POSN                           0x3
#define _LCDDATA14_SEG19COM2_POSITION                       0x3
#define _LCDDATA14_SEG19COM2_SIZE                           0x1
#define _LCDDATA14_SEG19COM2_LENGTH                         0x1
#define _LCDDATA14_SEG19COM2_MASK                           0x8
#define _LCDDATA14_SEG20COM2_POSN                           0x4
#define _LCDDATA14_SEG20COM2_POSITION                       0x4
#define _LCDDATA14_SEG20COM2_SIZE                           0x1
#define _LCDDATA14_SEG20COM2_LENGTH                         0x1
#define _LCDDATA14_SEG20COM2_MASK                           0x10
#define _LCDDATA14_SEG21COM2_POSN                           0x5
#define _LCDDATA14_SEG21COM2_POSITION                       0x5
#define _LCDDATA14_SEG21COM2_SIZE                           0x1
#define _LCDDATA14_SEG21COM2_LENGTH                         0x1
#define _LCDDATA14_SEG21COM2_MASK                           0x20
#define _LCDDATA14_SEG22COM2_POSN                           0x6
#define _LCDDATA14_SEG22COM2_POSITION                       0x6
#define _LCDDATA14_SEG22COM2_SIZE                           0x1
#define _LCDDATA14_SEG22COM2_LENGTH                         0x1
#define _LCDDATA14_SEG22COM2_MASK                           0x40
#define _LCDDATA14_SEG23COM2_POSN                           0x7
#define _LCDDATA14_SEG23COM2_POSITION                       0x7
#define _LCDDATA14_SEG23COM2_SIZE                           0x1
#define _LCDDATA14_SEG23COM2_LENGTH                         0x1
#define _LCDDATA14_SEG23COM2_MASK                           0x80
#define _LCDDATA14_MSK0_POSN                                0x0
#define _LCDDATA14_MSK0_POSITION                            0x0
#define _LCDDATA14_MSK0_SIZE                                0x1
#define _LCDDATA14_MSK0_LENGTH                              0x1
#define _LCDDATA14_MSK0_MASK                                0x1
#define _LCDDATA14_MSK1_POSN                                0x1
#define _LCDDATA14_MSK1_POSITION                            0x1
#define _LCDDATA14_MSK1_SIZE                                0x1
#define _LCDDATA14_MSK1_LENGTH                              0x1
#define _LCDDATA14_MSK1_MASK                                0x2
#define _LCDDATA14_MSK2_POSN                                0x2
#define _LCDDATA14_MSK2_POSITION                            0x2
#define _LCDDATA14_MSK2_SIZE                                0x1
#define _LCDDATA14_MSK2_LENGTH                              0x1
#define _LCDDATA14_MSK2_MASK                                0x4
#define _LCDDATA14_MSK3_POSN                                0x3
#define _LCDDATA14_MSK3_POSITION                            0x3
#define _LCDDATA14_MSK3_SIZE                                0x1
#define _LCDDATA14_MSK3_LENGTH                              0x1
#define _LCDDATA14_MSK3_MASK                                0x8
#define _LCDDATA14_MSK4_POSN                                0x4
#define _LCDDATA14_MSK4_POSITION                            0x4
#define _LCDDATA14_MSK4_SIZE                                0x1
#define _LCDDATA14_MSK4_LENGTH                              0x1
#define _LCDDATA14_MSK4_MASK                                0x10
#define _LCDDATA14_MSK5_POSN                                0x5
#define _LCDDATA14_MSK5_POSITION                            0x5
#define _LCDDATA14_MSK5_SIZE                                0x1
#define _LCDDATA14_MSK5_LENGTH                              0x1
#define _LCDDATA14_MSK5_MASK                                0x20
#define _LCDDATA14_MSK6_POSN                                0x6
#define _LCDDATA14_MSK6_POSITION                            0x6
#define _LCDDATA14_MSK6_SIZE                                0x1
#define _LCDDATA14_MSK6_LENGTH                              0x1
#define _LCDDATA14_MSK6_MASK                                0x40
#define _LCDDATA14_MSK7_POSN                                0x7
#define _LCDDATA14_MSK7_POSITION                            0x7
#define _LCDDATA14_MSK7_SIZE                                0x1
#define _LCDDATA14_MSK7_LENGTH                              0x1
#define _LCDDATA14_MSK7_MASK                                0x80

